using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Задание_5._1
/* а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания. 
 Константинов В.А.*/
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Имя: Владимир. \nФамилия: Константинов. \nГород: Одинцово.");
            Console.Read();
        }
    }
}
